<html>
<head>
  <link href="style.css" rel="stylesheet" type="text/css"/>
</head>
<body>
<h1>K&uuml;rzeste Wege finden</h1>

<h2>Wie findest du deinen Weg?</h2>
<table cellpadding="0" cellspacing="0" border="0">
<tr>
  <td valign="top">
    <p>Wie findest du den k&uuml;rzesten Weg zu deinem Ziel wenn du irgendwo hin- gehst oder f&auml;hrst? Nat&uuml;rlich benutzt du einen Routenplaner wie z.b. Google Maps oder ein Navi. Oder du bevorzugst vielleicht immer noch &quot;altmodische&quot; Karten um deinen Weg zu finden. Man kann leicht einen guten, wenn nicht k&uuml;rzesten, Weg zwischen zwei Orten mit Hilfe einer Karte bestimmen. Das geht weil Menschen relativ gut bei dieser visuellen Aufgabe sind, solange nur benachbarte Orte auf der Karte miteinander verbunden sind. Aber versuche mal den k&uuml;rzesten Weg zwischen dem Punkt 2 und allen anderen im Beispiel rechts zu finden. Nicht einfach, oder?
    </p>
  </td>
  <td valign="top"><img src="g1.png" border="1"></td>
</tr>
</table>

<h2>K&ouml;nnen Computer helfen?</h2>
<table cellpadding="0" cellspacing="0" border="0">
<tr>
  <td valign="top"><img src="sf.png" border="1"></td>
  <td valign="top">
    <p>Vielleicht sollten wir l&auml;stige Aufgaben wie diese Computer &uuml;berlassen, die das recht gut k&ouml;nnen. Zuerst mal brauchen sie eine Abstraktion realer Dinge aus der echten Welt in einem Format das sie &quot;verstehen&quot; k&ouml;nnen. F&uuml;r Karten verwenden Computer oft <i>Graphen</i>, wobei Orte (z.b. St&auml;dte) durch <i>Knoten</i> dargestellt werden und Verbindungen zwischen Orten (z.b. Stra&szlig;en) durch <i>Kanten</i> repr&auml;sentiert werden. Das obige Bild stellt einen Graphen dar wobei nummerierte Knoten durch Kanten (Linien) verbunden sind.</p>
  </td>
</tr>
</table>

<h2>Ja, aber wie machen die das?</h2>
<p>Wie findet ein Computer nun den k&uuml;rzesten Weg zwischen zwei beliebigen Orten, sobald er &uuml;ber geographischen Positionen und Verbindungen Bescheid weiss? Wie w&uuml;rdest du &quot;ihm sagen&quot; dass er es machen soll? Alle m&ouml;glichen Wege zwischen zwei Punkten finden und ihre L&auml;nge vergleichen? Das k&ouml;nnte eine Weile dauern, sogar f&uuml;r einen schnellen Computer. Es muss einen besseren Weg geben? Es gibt einen.</p>

<h2>Sie benutzen Algorithmen.</h2>
<p>Eine relativ einfache, jedoch durchaus m&auml;chtige, Methode um die k&uuml;rzesten Wege zwischen einem Startknoten und <i>allen</i> anderen Knoten in einem Graphen zu finden, ist <i>Dijkstra's Algorithmus</i> zu benutzen. Hab' keine Angst vor dem Wort &quot;Algorithmus&quot;. Stell dir einen Algorithmus als einen eindeutigen Plan vor, den ein Computer ausf&uuml;hren kann um ein bestimmtes Problem zu l&ouml;sen. Von einer gegebenen Eingabe (z.B. einem Graphen) wird vom Algorithmus ein Ergebnis berechnet (z.B. die k&uuml;rzeste Wege zu einem Startknoten). Elegante und effiziente Algorithmen zu entwickeln ist eine Herausforderung und fortw&auml;hrender Gegenstand der Forschung.</p>

<h2>Dijsktra's Algorithmus findet <i>k&uuml;rzere</i> k&uuml;rzeste Wege zuerst.</h2>
<p>Wie funktioniert Dijsktra's Algorithmus nun? Anstatt alle m&ouml;glichen Wege zwischen dem Startknoten und allen anderen Knoten zu &uuml;berpr&uuml;fen, werden die k&uuml;rzesten Wege zu n&auml;her am Startknoten liegenden Knoten zuerst gefunden (die k&uuml;rzeren k&uuml;rzesten Wege). Dieses zus&auml;tzliche Wissen wird dann dazu genutzt die Wege zu weiter entfernten Knoten zu finden.</p>

</body></html>